%2주차 과제 1

x = 2;
a = 6 * x^3 + 4 / x

x = 9;
b = x / 4^3

x = 8;
c = (4*x)^2 / 25

x = 3;
d = 2 - sin(x)/5%???

x = 20;
e = 7 * (x ^(-1/3))+4*x^0.58

%2주차 과제 2

a = (3/4)*6*7^2+4^5/(7^3-145)

b = (48.2*55-9^3)/(53+14^2)

c = 27^2/4 +319^(4/5)/5+60*14^(-3)

%2주차 과제 3

r1 = 3;
r2 = r1 * nthroot(1.3,3)

%2주차 과제 4

a = exp((-2.1)^3) + 3.47*log(14) + nthroot(287, 4)
b = 3.4 ^ 7 *  log(14) + nthroot(287, 4)

%2주차 과제 5

x = 0:0.01:2;
u = 3*log10(70*x+1);
v = 4 * cos(7*x);
plot(x, u, x, v);
xlabel('mile')
ylabel('mile/h')

grid on
